#include<bits/stdc++.h> // 비트마스킹
using namespace std;

// 비트마스킹 :불리언 배열의 역할을 하는 하나의 숫자를 만들어서 
// 비트연산자를 통해 탐색, 수정 등의 작업을 하는 것. 
// 비트 : BIT : BInary digiT

// 경우의 수 표현

const int n = 4;
int main() {   
	string a[n] = {"사과", "딸기", "포도", "배"};
	for(int i = 0; i < (1 << n); i++){ // 0000 ~ 1111
		string ret = "";
        cout << i << " : ";
		for(int j = 0; j < n; j++){
			if(i & (1 << j)){ 
                // 0000 & 0001  0000 & 0010  0000 & 0100  0000 & 1000
                // 0001 & 0001  0001 & 0010  0001 & 0100  0001 & 1000
                // ...
                // 1110 & 0001  1110 & 0010  1110 & 0100  1110 & 1000
                // 1111 & 0001  1111 & 0010  1111 & 0100  1111 & 1000
				ret += (a[j] + " ");
			}
		}
        cout << '\n';
		cout << ret << '\n';
	} 
    return 0;
}

